<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
<style type="text/css">
<!--
#Layer1 {
	position:absolute;
	left:7px;
	top:0;
	width:656px;
	height:398px;
	z-index:1;
}
.style1 {
	font-size: 18px;
	font-weight: bold;
}
a:link {
	color: #0033CC;
}
a:visited {
	color: #0033CC;
}
a:hover {
	color: #990000;
}
a:active {
	color: #0033CC;
}
-->
</style>
</head>

<body>
<div id="Layer1">
  <div align="justify">
    <p class="style1"><a name="_Toc124075464" id="_Toc124075464">Configura&ccedil;&otilde;es</a></p>
    <p>Existem alguns  passos que s&atilde;o necess&aacute;rios completar de maneira a preparar o computador para a  execu&ccedil;&atilde;o de aplica&ccedil;&otilde;es do X3D integrado com Java. </p>
    <p>&nbsp;</p>
    <p class="style1"><a name="_Toc124075465" id="_Toc124075465">Prepara&ccedil;&atilde;o do computador para usar SAI</a></p>
    <p>Vai de seguida  proceder-se &agrave; explica&ccedil;&atilde;o dos passos necess&aacute;rios para preparar o computador para  editar e executar aplica&ccedil;&otilde;es usando SAI.</p>
    <ol start="1" type="i">
      <li>Instalar o<em> Xj3D       installer for Windows</em> que j&aacute; possui o Java 1.4.2_06. Com esta ac&ccedil;&atilde;o       v&atilde;o ser instalados o <em>browser</em> Xj3D e o JAVA2 <em>Runtime enviroment</em> SE V1.4.2_07. (<a href="http://www.xj3d.org/download.html">http://www.xj3d.org/download.html</a>) </li>
    </ol>
    <ol start="2" type="i">
      <li>Instalar o Netbeans. </li>
    </ol>
    <ol start="3" type="i">
      <li>Para compilar uma aplica&ccedil;&atilde;o Java em que se use o       SAI necessitamos de usar a <em>package</em> org.web3d.x3d.sai. Para a podermos utilizar, necessitamos de definir a <em>classpath</em> do Java. O browser Xj3D       possui os jars necess&aacute;rios para o <em>package</em> org.web3d.x3d.sai, pelo que basta copiar estes ficheiros do local de       instala&ccedil;&atilde;o do xj3d: &ldquo;C:\Programas\Xj3D\jars&rdquo; (por defeito), para a directoria: C:\j2sdk1.4.2_04\jre\lib\ext (por       defeito), criada na instala&ccedil;&atilde;o do Netbeans. Ao executar o Netbeans os       ficheiros v&atilde;o ser acedidos automaticamente, permitindo a utiliza&ccedil;&atilde;o da <em>package</em> org.web3d.x3d.sai. Este       passo n&atilde;o necessita de ser realizado se n&atilde;o pretendermos compilar nenhuma       aplica&ccedil;&atilde;o.</li>
    </ol>
    <ol start="4" type="i">
      <li>Para usar aplica&ccedil;&otilde;es Java com X3D atrav&eacute;s de SAI,       usando o browser xj3d necessitamos de ter estas aplica&ccedil;&otilde;es na directoria       de instala&ccedil;&atilde;o do Xj3D. Ao instalar o Xj3D &eacute; criada uma directoria       &ldquo;examples&rdquo; (C:\Programas\Xj3D\examples). As aplica&ccedil;&otilde;es Java devem ser       colocadas dentro de uma pasta, nesta directoria. </li>
    </ol>
    <ol start="5" type="i">
      <li>Para executar a aplica&ccedil;&atilde;o Java &eacute; usado um ficheiro       bat. No caso especifico da aplica&ccedil;&atilde;o desenvolvida, este ficheiro vai       atribuir mais mem&oacute;ria ao <em>Java       Virtual Machine</em>, especificar as bibliotecas necess&aacute;rias e executa a       aplica&ccedil;&atilde;o Java. Para cada aplica&ccedil;&atilde;o Java diferente dever&aacute; editar-se este       ficheiro bat e modificar o nome da aplica&ccedil;&atilde;o Java para a aplica&ccedil;&atilde;o actual.</li>
    </ol>
    <p><a name="_Toc121219742" id="_Toc121219742">&nbsp;</a></p>
    <p><a name="_Toc124075466" class="style1" id="_Toc124075466">Prepara&ccedil;&atilde;o o computador para usar n&oacute;s de som</a></p>
    <p>Para executar  som numa cena X3D &eacute; necess&aacute;rio a instala&ccedil;&atilde;o do OpenAL, biblioteca muito  utilizada em aplica&ccedil;&otilde;es e jogos que necessitem de &aacute;udio 3D.</p>
    <p>Deve fazer-se o <em>download</em> do OpenAL11CoreSDK.exe da  p&aacute;gina do OpenAL e instalar este software. (<a href="http://www.openal.org/">http://www.openal.org/</a>)</p>
  </div>
</div>
</body>
</html>
